{
  "title": "Head of Performance Optimisation",
  "reference": "1503589",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "London, North West",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "maxSalary": "90,000",
  "minSalary": "64,000",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "29 September 2016",
  "datePosted": "3 August 2016",
  "responsibilities": "Leading and embedding all planning activities ensuring alignment with the business planning cycle and departmental priorities and integration with functional business plans.<br><br>Visible and inspirational leadership to develop a high performing and collaborative workforce.<br><br>Defining and implementing a performance management framework to include KPI development, data capture, reporting, methods and tools to enable performance to be captured, managed and improved in ‘real time’.<br><br>Leadership and development of the Business Operations Management team; standardising and the team’s design in each Function focussing on business planning, portfolio management, pipeline management, capability development, resource management and marketing and communications.<br><br>Co-ordinating audit and compliance activities; working closely with colleagues to create strategic risk reports business continuity plans.<br><br>Developing and managing delivery of an annual cost optimisation work plan, ensuring activities are prioritised in order to deliver annual cost savings; leading the Asset Management function to support delivery of improved financial management and asset optimisation.<br><br>Supporting the development and implementation of a Target Operating Model ensuring new services, capabilities and common processes are supported and end-to-end Digital Lifecycle processes are aligned and embedded.<br><br>Work closely with the Head of Role to establish the Business Operations Management Profession within DWP Technology and across Government.",
  "skills": "",
  "description": "You will lead on defining and implementing performance optimisation strategies and programmes to enable the Technology Group to meet or exceed strategic targets. You will have some direct line management responsibility in addition to matrix management.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/jobs.cgi?jcode=1503589"
}
