{
  "title": "Principal Software Developer",
  "reference": "1504457",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Blackpool, Leeds, Manchester, Newcastle",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "maxSalary": "70,000",
  "minSalary": "",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "28 August 2016",
  "datePosted": "10 August 2016",
  "responsibilities": "",
  "skills": "",
  "description": "This is a once-in-a-generation opportunity for digital experts to improve millions of lives. DWP are going through one of the highest profile digital transformation programmes in the world, and we are advertising Principal Software Developer vacancies to find the talent to deliver this change.<br><br>As a Principal Software Developer you will provide technical leadership to a small, talented and committed team of Software Developers and provide expert oversight to the products they develop.<br><br>You will own the overall Software Development Process within Software Engineering and set the strategies for products and the wider community.<br><br>Working with a range of skilled colleagues, including Technical Architects, you will contribute to the Architectural & Software Engineering principals and help ensure systems are fit for purpose.<br><br>With a focus on stability and availability and a passion for quality you will be accountable for the code your teams produce.<br><br>A skilled practitioner and role model in software craftsmanship, the Principal Software Developer will lead colleagues across the department and beyond in the pursuit of best possible practices and guide teams on the best ways to deliver a quality product.<br><br>Watch the video below and read the recent articles to find out more about who we are and the work we do.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/jobs.cgi?owner=5070000&ownertype=fair&jcode=1504457&posting_code=0&language="
}
