{
  "title": "Lead Software Developer",
  "reference": "1509037",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Blackpool, Leeds, Manchester, Newcastle, Sheffield",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "maxSalary": "70,000",
  "minSalary": "",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "16 October 2016",
  "datePosted": "5 September 2016",
  "responsibilities": "DWP are going through one of the highest profile digital transformation programmes in the world.　This is a once-in-a-generation opportunity for digital experts including Lead Software Developers to improve millions of lives.<br/><br/>
  As a Lead Software Developer you will provide technical leadership to a talented and committed team of Software Developers and provide expert oversight to the products they develop.<br/><br/>
  You will own the team’s software development process along with setting the strategies for products and the wider community. You will be using open source technologies like Java, JavaScript, Node.js<br/><br/>
  <br/><br/>Working with a range of colleagues, including Technical Architects, you will contribute to the Architectural & Software Engineering principles and help ensure systems are fit for purpose.<br/><br/>
  With a focus on stability and availability and a passion for quality you will be accountable for the code your teams produce.<br/><br/>
  A skilled practitioner and role model in software craft, you will lead colleagues across the department and beyond in the pursuit of best possible practices and guide teams on the best ways to deliver a quality product.",
  "skills": "Degree or Masters in Computer Science<br>TOGAF Certified<br>ISEB Certification in Enterprise and Solution Architecture",
  "description": "Up to £68,115 for Principal Architect & £55,675 Lead Architect.<br><br>Do you have the desire and ambition to come and shake up outdated Government technology and fundamentally transform the way our business operates?<br><br>We invite you to join one of the largest technology challenges in the UK today – a once in a generation programme of transformational change.<br><br>Here at the Department for Work and Pensions (DWP) we are re-platforming our entire IT onto new hardware, operating systems, application server technologies and application integrations, conducting large scale data migration, introducing new functionality and modernising front end user interfaces and applications. These IT systems underpin the services that support 22m citizens, annual processing of 7.35m benefit claims, payment of £165bn in benefits and pensions, and over 90,000 employees across 950 locations.<br><br>We are keen to recruit the best architecture talent out there, people who have hands on delivered multi-tier architectures/applications and micro-service architectures, with a passion and detailed technical knowledge of any of the following:-<br><br>Web technologies including HTTP, HTML, CSS, XML, JSON, SOAP, REST<br>Enterprise scale database technologies including Oracle & Enterprise DB and NoSQL, Cassandra & MongoDB<br>Operating systems including Linux & Solaris<br>Application server platforms including as Websphere & Jboss<br>Virtualisation technologies including as VMware, OVM, HyperV",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/index.cgi?SID=cGFnZWFjdGlvbj12aWV3dmFjYnlqb2JsaXN0Jm93bmVyPTUwNzAwMDAmcGFnZWNsYXNzPUpvYnMmc2VhcmNoX3NsaWNlX2N1cnJlbnQ9MSZvd25lcnR5cGU9ZmFpciZ1c2Vyc2VhcmNoY29udGV4dD0yMDkzOTM3OSZjc291cmNlPWNzcXNlYXJjaCZqb2JsaXN0X3ZpZXdfdmFjPTE0ODY3MDYmcmVxc2lnPTE0NjU5OTk3NDQtYmQ1MWNlZDJlZTczYWI1ZGRmNTEwMGYyYzY2NjkyZmUxNjYxNDNlZA=="
}
