{
  "title": "Cyber Intelligence Lead Manager",
  "reference": "1513294",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "London",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1513294",
  "maxSalary": "Upto £74,347",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "18 November 2016",
  "datePosted": "5 September 2016",
  "responsibilities": "",
  "description": "Department for Work & Pensions (DWP) is offering an exciting opportunity in central London for Cyber Intelligence Leads looking to do work of real scale and significance.<br/><br/>The work you do here to manage risk, develop security counter measures and develop and share intelligence will ensure that DWP, and the whole of government, can safely continue to make a difference and positively impact the lives of millions of people across the UK.<br/><br/>Working for the Cyber Resilience Centre (CRC) you will be part of an innovative team working with both Government and private sector partners to build capability, detect malicious behaviour, and respond to emerging online threats.<br/><br/>A uniquely-skilled team, CRC is home to a complex blend of fraud intelligence, analysis and technical capabilities, and well-developed inter-personal abilities including the communication skills necessary to deliver complex messages to a wide audience of various backgrounds.<br/><br/>As the Cyber Intelligence Lead you will be responsible for coordinating the delivery of Cyber Intelligence to a broad range of stakeholders through the effective management of a talented team of intelligence professionals.<br/><br/>In close partnership with Security Risk colleagues you will deter, defend and detect likely and actual threats to Departmental assets. You’ll have the chance too to design processes which enable the speed and flexibility of response required within a digital, agile environment like ours.<br/><br/>We believe the work we do really matters, and needs to be done by an expert, so we need you to have CREST Certified Threat Intelligence Manager (CCTIM) or an equivalent cyber intelligence qualification or experience, and a deep understanding of the concepts of information security and ICT cyber security technologies, such as firewalls, Intrusion detection and protection systems (IDS/IPS), and security information and event management (SIEM).<br/><br/>You know like we do that cyber security is a complex and rapidly evolving arena, and so you will be keen to maintain your leading edge knowledge of new technologies and threat vectors that could impact upon the business.<br/><br/>We serve people from every possible background from all across the UK, and we are looking for applicants who reflect that diversity and who share our values on equality.<br/><br/>So, if you have the vision, experience and intellectual dexterity to help us tackle some of the most complex cyber security challenges in the UK, and if you can enable and empower those around you to be their best, then please complete an application today. We’d love to hear from you.",
  "url": "https://www.civilservicejobs.service.gov.uk/job.cgi?1513294.0"
}
