{
  "title": "Senior Test Engineer",
  "reference": "1513757",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Blackpool",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1513757",
  "maxSalary": "Up to £31,635",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "12 December 2016",
  "datePosted": "5 September 2016",
  "responsibilities": "",
  "description": "DWP Digital offers uniquely challenging and fulfilling career opportunities for people interested in making a genuine difference to society.<br/<br/>As a Senior Test Engineer in DWP’s Tech hub in Blackpool we expect you to lead on a particular phase of testing, so you’ll need good experience of manual/automation testing and end-to-end test delivery, and have significant knowledge of all test phases, including System Integration, Performance, OAT, Security and UAT.<br/><br/>We’re the UK’s biggest government department: few other organisations globally provide the same opportunity to apply next-generation digital technology on a massive scale to issues which touch the lives of so many. We support 20 million people every day to help them to find work and save for their future. We provide financial assistance worth over £180 billion each year to ensure that the most vulnerable in society are protected.<br/><br/>As a Senior Test Engineer with DWP you’ll have a unique opportunity to put your skills to use on services that support millions of people across the country, developing and defining test plans and procedures, automation frameworks, traceablility matrices, and monitoring and managing progress and risks, for systems and services on a scale which you’re unlikely to experience again in your career.<br/><br/>At one time or another, everyone in the UK will use our services so it’s really important we get it right. This is your chance to work at the leading edge of technology in a large, complex environment, and help to give every person in the UK innovative digital products and services that they can rely on.<br/><br/>ISEB certified, you’ll know your way around a variety of methodologies, including TDD, BDD and Agile. We’re particularly keen to hear from you if you’ve got skills and experience in regression testing, system and integration testing and API testing.<br/><br/>You’ll work with a diverse group of people who want to be the best at what they do together. We offer career-enhancing roles which apply the latest technologies and techniques to meaningful, high profile work. Our people also enjoy the security, flexibility and work-life balance that a brilliant civil service offers.<br/><br/>As part of our growing Test Community you will also have chance to share your skills and experience with talented and curious colleagues via our new Test Knowledge Hub and by actively participating in coaching and mentoring activities.<br/><br/>Our strategy in DWP Digital is to deliver often, iteratively and repeatedly. We combine design-thinking and technology to transform user experiences. If you work for us, you’ll have a once-in-a-generation opportunity to be part of something big and unique.<br/><br/>If you want to work in empowered, multi-disciplinary teams in an environment which values enthusiasm, talent and creativity over hierarchy, then we’d love to hear from you today.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/jobs.cgi?owner=5070000&ownertype=fair&jcode=1513757&posting_code=0&language="
}
