{
  "title": "Senior DevOps",
  "reference": "1513507",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "London, Newcastle",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1513507",
  "maxSalary": "Upto £50,755",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "6 December 2016",
  "datePosted": "5 September 2016",
  "responsibilities": "",
  "description": "This is a once-in-a-generation opportunity for digital experts to improve millions of lives. DWP are going through one of the highest profile digital transformation programmes in the world and we’re advertising Senior DevOp Engineer vacancies to find the talent to help deliver that change.<br/><br/>As a Senior DevOp Engineer you will be responsible for the build, support and administration of Hadoop cluster solutions and the surrounding analytics and visualisation services (both physical and virtual)<br/><br/>You will be contribute to loading and running bulk data transfers and the creation of scripts to support the cleansing and scrubbing of data, whilst monitoring infrastructure services and alerts and taking appropriate action.<br/><br/>We are looking for candidates who have:<br/><br/>Experience of delivering, building, maintaining solutions and services using Hadoop that support different analytics and/or data visualisation cases.<br/><br/>Understanding of data management regulations and policies and information lifecycle management frameworks and solutions.<br/><br/>A strong knowledge of web application architectures and defining solution roadmaps.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/index.cgi?SID=cGFnZWFjdGlvbj12aWV3dmFjYnlqb2JsaXN0JnVzZXJzZWFyY2hjb250ZXh0PTI4NzAzMTEzJnNlYXJjaF9zbGljZV9jdXJyZW50PTEmb3duZXI9NTA3MDAwMCZvd25lcnR5cGU9ZmFpciZwYWdlY2xhc3M9Sm9icyZjc291cmNlPWNzcXNlYXJjaCZqb2JsaXN0X3ZpZXdfdmFjPTE1MTM1MDcmcmVxc2lnPTE0Nzk0ODY0MTUtZjc2ZTNjM2JkYzRmZjRlNDE5ZGM4Y2U1MWNkMmM3OGNmNTc5ZTAyYQ=="
}
