{
  "title": "Lead Portfolio Manager",
  "reference": "1522077",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Peel Park, Blackpool",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1522077",
  "maxSalary": "Upto £56,232",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "6 January 2017",
  "datePosted": "6 October 2016",
  "responsibilities": "",
  "description": "The Digital Group COO is developing and delivering a world class Portfolio Management Service, and bringing together the complete Digital Portfolio through cutting edge Tooling and automation products. To provide insight, visualisation and reporting of the totality of the Portfolio, with a clear focus on unblocking, tracking and enabling the delivery of the Portfolio. This insight will inform executive decision making, intervention and providing a key enabling and assurance service to the Digital Executive Team we are doing the right things in the right way. This role will lead the management, analysis and tracking of the overall Digital Delivery Portfolio to the COO Director, COO Portfolio Board and Digital Executive Team.<br/><br/>As a Lead Portfolio Managers you will develop, apply and continuously improve a systematic Portfolio Management framework to unblock, enable and track progress for a large complex portfolio of projects and programmes.<br/><br/> This will include;<br/><br/>- Implementing, operating and running an efficient decision making process based on objective tracking of desired outcomes, cost, risk, inter-dependencies and impact on existing Portfolio, unblocking issues and planning dependencies to enable individual projects to make faster progress.<br/>- Regularly tracking the portfolio for delivery progress to offer constructive advice, share design and delivery patterns and escalate projects where delivery progress needs to accelerate.<br/>- Using delivery expertise to assure RAG rating based on iterative delivery progress.<br/>- Recommending and implementing corrective actions by engaging and influencing senior management to remove delivery choke points.<br/>- Supporting the development of delivery and financial planning processes and standards to promote up to date self-service portfolio tracking.<br/><br/>Your Key responsibilities will be to;<br/><br/>- Lead the day to day delivery of the Digital Portfolio Management function.<br/>- Know the key portfolio deliverables, dependencies and opportunities and take enabling action to accelerate and assure delivery progress.<br/>- Provide support as a key focal point for the organisation on the strategic position and status of the overall Portfolio of work.<br/>- Co-ordinate the definition of an efficient portfolio management framework to enable delivery.<br/>- Establish data visualisation Dashboards to track delivery progress and key performance indicators.<br/>- Co-ordinate and enable the simplification and delivery of effective portfolio governance and approvals arrangements.<br/>- Engage with colleagues to learn and change based on user feedback.<br/>Shaping and managing enabling forums to mitigate key risks informed by better planning, transparency and key metrics.<br/>- Provide a clear, strategic and accepted position of the status, interdependencies, risks and opportunities within the Portfolio.<br/>- Co-ordinate and define the Digital delivery methodologies and create pan-government alignment where possible.<br/>- Lead people engagement in order to build a collaborative and engaged DWP Digital working environment.<br/>- Grow and develop colleagues to explore their potential, ideas and suggestions.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/index.cgi?SID=cGFnZWNsYXNzPUpvYnMmcGFnZWFjdGlvbj12aWV3dmFjYnlqb2JsaXN0JnVzZXJzZWFyY2hjb250ZXh0PTMwMTU4NzI2JnNlYXJjaF9zbGljZV9jdXJyZW50PTEmb3duZXI9NTA3MDAwMCZjc291cmNlPWNzcXNlYXJjaCZvd25lcnR5cGU9ZmFpciZqb2JsaXN0X3ZpZXdfdmFjPTE1MjIwNzcmcmVxc2lnPTE0ODIzOTcwODYtM2NiZTBiZmZmZGNjNmMyNjAwNWVmOWRmNGU1MGEzZWViZWMxZTZhMg"
}
