{
  "title": "Senior Digital Oracle Financial Database Adminstrator",
  "reference": "1523894",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Stockport for 6 months then relocating to Manchester",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1523894",
  "maxSalary": "Upto £56,232",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "26 January 2017",
  "datePosted": "6 October 2016",
  "responsibilities": "",
  "description": "This is a once-in-a-generation opportunity for digital experts to improve millions of lives. DWP are going through one of the highest profile digital transformation programmes in the world and we’re advertising this vacancy to find the talent to help deliver that change.<br/><br/>As a Digital Oracle Financial Database Administrator you will be responsible in administering, supporting and maintaining Oracle database services as directed and according to departmental policy and processes.<br/><br/>You will provide specialist technical database support and assistance to projects ensuring delivery of requisite non-functional requirements.<br/><br/>We are looking for people who have:<br/><br/>- In-depth experience in the administration of Oracle Database Administration to version 12c and of Oracle Application Server.<br/>- Proven experience of impacting, testing and applying patches and version upgrades to Oracle E-Business Suite and Oracle Databases.<br/>- Extensive experience in performing tuning at the database and application level.<br/><br/>DWP is an equal opportunity employer with a diverse workforce. We welcome applications regardless of age, gender, race or sexuality.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/index.cgi?SID=c2VhcmNoX3NsaWNlX2N1cnJlbnQ9MSZjc291cmNlPWNzcXNlYXJjaCZvd25lcnR5cGU9ZmFpciZwYWdlYWN0aW9uPXZpZXd2YWNieWpvYmxpc3QmdXNlcnNlYXJjaGNvbnRleHQ9MzEwNDE4MTkmb3duZXI9NTA3MDAwMCZwYWdlY2xhc3M9Sm9icyZqb2JsaXN0X3ZpZXdfdmFjPTE1MjM4OTQmcmVxc2lnPTE0ODQzMDA2OTMtZWIzZjc4OWRkNzA0OGU5M2NiYTljNTdlODNkMDdhYTE4NTk1ZDUzOQ"
}
