{
  "title": "Principle Domain Architects",
  "reference": "1526595",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Blackpool, Manchester (if chosen location is Manchester, posts in Manchester will be located initally in Warrington and then re-located to Manchester)",
      "addressRegion": "",
      "postalCode": ""
    }
  },
  "jobReference": "1526595",
  "maxSalary": "up to £91,535 at G6 up to £72,045 at G7",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "13 February 2017",
  "datePosted": "6 October 2016",
  "responsibilities": "",
  "description": "The Principal Domain Architect is a key role to ensure the Department makes the best use of existing technology, makes considered decisions about future technology investments required to transform the Departments technology architecture.<br/><br/>The Principal Domain Architect:<br/><br/>- Has a clear understanding of the current technology architecture, creates a definition of the future architecture and provides options for the transformation to that future.<br/>- Defines the future architecture through a set of principles, patterns and standards.<br/>- Articulates the transition from the current to future state, [in consideration of the future needs of the business requirements], striking a balance between standardisation, customisation, innovation, costs, and risk management.<br/>- Works closely with the functional solution architects to ensure that the technology solutions being delivered are aligned with and move the architecture from the current to future state.<br/>- Works with business transformation designers to take an early view of the potential ask of technology, and understand best application of technology to deliver business change and achieve Departmental objectives.<br/>- The Principal Domain Architect must be industry aware and consider emerging technologies that would benefit the Department’s business ask.<br/>- Widely visible internally and externally talking about work and technical issues, people seek them out for help and advice - a role model for technical architecture. <br/><br/>DWP is an equal opportunity employer with a diverse workforce. We welcome applications regardless of age, gender, race or sexuality.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/index.cgi?SID=b3duZXI9NTA3MDAwMCZ1c2Vyc2VhcmNoY29udGV4dD0zMjEwMzY0MiZvd25lcnR5cGU9ZmFpciZqb2JsaXN0X3ZpZXdfdmFjPTE1MjY1OTUmY3NvdXJjZT1jc2ZzZWFyY2gmc2VhcmNoX3NsaWNlX2N1cnJlbnQ9MSZwYWdlYWN0aW9uPXZpZXd2YWNieWpvYmxpc3QmcGFnZWNsYXNzPUpvYnMmcmVxc2lnPTE0ODU4NTI4NTctOTBiNDgxNzhlY2NhNmM2NzRjNTg1NTc0NmYzN2UyNDczMjA4MTc5Zg"
}
