{
  "title": "Front end developer",
  "reference": "1494151",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Leeds",
      "addressRegion": "West Yorkshire",
      "postalCode": "LS10 1ET"
    }
  },
  "maxSalary": "53,000",
  "workHours": "37 hours per week",
  "employmentType": "Permanent, Employed",
  "dateClosing": "12 June 2016",
  "datePosted": "25 May 2016",
  "responsibilities": "Develop the front-end implementations and functionality for digital services as part of the agile delivery processes that will have a significant impact on the service’s performance.<br><br>Be an exemplar voice within the wider government web development community; identifying good practices to adopt and sharing experiences.<br><br>Support the work of our Digital Academy<br><br>Acting as the authority on matters that have no predictable outcome.<br><br>Providing decision makers with information, advice and a recommended courses of action for within this area.<br><br>To impact and significantly influence the performance of colleagues to achieve key working objectives for business critical programmes within an agile environment.",
  "skills": "Proven track record and detailed knowledge of working with HTML, JavaScript and CSS.<br><br>Proven track record of building front end interfaces for high-traffic websites using a range of technologies and libraries for numerous organisations.<br><br>Significant experience of working with designers and user researchers to build and test prototypes for products and services within business critical programmes.<br><br>Proven experience of Responsive Web Design.<br><br>Detailed specialist knowledge of web accessibility.<br><br>Working knowledge of the use of version control systems such as subversion or git.",
  "description": "The Department for Work and Pensions is introducing the biggest change to the welfare system in 60 years and we’re looking for a talented Front End Developer to join our UX Design team in Leeds.<br><br>The User Experience Design team is designing the digital services to deliver these exciting changes. We work as part of our new Digital DWP hubs with our own Digital Academy to deliver exemplary digital services.<br><br>We believe that good design means starting with user needs. Good design is something that works well for the people that need to use it. The User Experience team is also linked to the wider design teams within the Government Digital Service and across government departments.<br><br>In this role you’ll be expected to work with other digital specialists to create services as part of GOV.UK.<br><br>The Front End Developer will work with agile teams, prototyping and building digital services, testing real products with real people. We put user research at the heart of everything we do so you’ll have the ability to test and iterate your work on a regular basis.<br><br>This is a challenging role that will appeal to an experienced Front End Developer looking to join a growing digital team. It is a permanent position with opportunities to grow and develop your role in the organisation.",
  "url": "https://www.civilservicejobs.service.gov.uk/csr/jobs.cgi?owner=5070000&ownertype=fair&jcode=1494151&posting_code=0&language="
}
